{
    "agile":{
        "row1":[{
                "url":"tech/agile-methodology/what-is-L1-L2-L3-tier-system-of-remote-it-support",
                "title": "What is L1, L2, L3 Tier System of Remote IT Support?",
                "desc":"The L1, L2, and L3 tier system of remote IT support categorizes expertise levels. L1 provides basic assistance like password resets. L2 handles more complex issues, offering deeper technical solutions. L3 tackles specialized problems requiring advanced expertise. Each tier escalates to the next for unresolved issues, ensuring efficient problem resolution.",
                "descFix":305,
                "createdOn": "Jan 26, 2023",
                "minRead": "5 min read"
            }],
        "row2":[{
                "url":"tech/agile-methodology/what-are-architecture-design-principles-and-how-does-agile-methodology-aligns-with-it",
                "title": "What are Architecture Design principles? How does Agile Methodology aligns with it?",
                "desc":"Architecture design principles are fundamental guidelines for creating software systems, ensuring scalability, maintainability, and reliability. Agile aligns with these principles by promoting iterative development, continuous feedback, and adaptability, enabling architecture to evolve alongside changing requirements, thus ensuring alignment with business goals.",
                "descFix":260,
                "createdOn": "Jan 26, 2023",
                "minRead": "5 min read"
            }],
        "row3":[{ 
                "url":"tech/agile-methodology/what-is-the-role-of-domain-driven-design-ddd-in-agile-architecture-and-how-it-helps-in-defining-bounded-contexts-and-microservices",
                "title": "What is the role of Domain-driven Design (DDD) in Agile Architecture and how it helps in defining bounded contexts and microservices?",
                "desc":"Domain-driven Design (DDD) in Agile Architecture defines boundaries (bounded contexts) aligning with business domains, facilitating microservices design for scalable, cohesive systems.",
                "descFix":245,
                "createdOn": "Jan 26, 2023",
                "minRead": "5 min read"
            }]
    },
    "node":{
        "row1":[{ 
            "url":"tech/node-js/overview-of-node-js-and-v8-engine-how-they-works-together",
            "title": "Overview of NodeJS and V8 Engine. How they works together?",
            "desc":"Node.js is a JavaScript runtime built on the V8 JavaScript engine, which powers Google Chrome. V8 compiles JavaScript into machine code, enabling rapid execution. Node.js extends this functionality to the server-side, allowing developers to run JavaScript outside of the browser, facilitating scalable and efficient backend development. Together, Node.js and V8 enable developers to write server-side applications in JavaScript, utilizing a single language across the entire tech stack.",
            "descFix":245,
            "createdOn": "Jan 26, 2023",
            "minRead": "5 min read"
        }],
        "row2":[{ 
            "url":"tech/node-js/understanding-buffer-classes-in-node-js",
            "title": "Understanding Buffer Classes in NodeJS",
            "desc":"Buffer classes in Node.js are used to handle binary data directly. They provide a way to work with raw memory allocated outside the V8 heap. Buffer instances can be created in various ways: by providing the length of the buffer, an array of octets, or a string. They offer methods to manipulate and convert data, making them crucial for tasks like reading/writing files, handling network data, and cryptographic operations.",
            "descFix":305,
            "createdOn": "Jan 26, 2023",
            "minRead": "5 min read"
        }],
        "row3":[]
    },
    "dockub":{
        "row1":[],
        "row2":[],
        "row3":[]
    },
    "kafka":{
        "row1":[],
        "row2":[],
        "row3":[]
    },
    "sysd":{
        "row1":[],
        "row2":[],
        "row3":[]
    },
    "dsAlgo":{
        "row1":[],
        "row2":[],
        "row3":[]
    }
}